Autodesk.Revit.DB.Structure.RebarBendData.CrankLength1
Identifies the crank length at the end.
The default value is 0. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.
Since:
2026

Autodesk.Revit.DB.Structure.RebarBendData.CrankLength0
Identifies the crank length at the start.
The default value is 0. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.
Since:
2026

Autodesk.Revit.DB.Structure.RebarBendData.CrankRatio1
Identifies the crank ratio at the end. The 1:crankRatio that defines the crank slope.
The default value is 0. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.
Since:
2026

Autodesk.Revit.DB.Structure.RebarBendData.CrankRatio0
Identifies the crank ratio at the start. The 1:crankRatio that defines the crank slope.
The default value is 0. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.
Since:
2026

Autodesk.Revit.DB.Structure.RebarBendData.CrankAngledLength1
Identifies the crank angled length at the end.
The default value is 0. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.
Since:
2026

Autodesk.Revit.DB.Structure.RebarBendData.CrankAngledLength0
Identifies the crank angled length at the start.
The default value is 0. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.
Since:
2026

Autodesk.Revit.DB.Structure.RebarBendData.CrankStraightLength1
Identifies the crank straight length at the end.
The default value is 0. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.
Since:
2026

Autodesk.Revit.DB.Structure.RebarBendData.CrankStraightLength0
Identifies the crank straight length at the start.
The default value is 0. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.
Since:
2026

Autodesk.Revit.DB.Structure.RebarBendData.CrankOffsetLength1
Identifies the crank offset length at the end.
The default value is 0. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.
Since:
2026

Autodesk.Revit.DB.Structure.RebarBendData.CrankOffsetLength0
Identifies the crank offset length at the start.
The default value is 0. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.
Since:
2026

Autodesk.Revit.DB.Structure.RebarBendData.HookAngle1
The angle (in degrees) of the hook at the end. Must be at least 0 and no more than 180. If the value is 0 it means that there is no hook.
The default value is 0. When setting from 0 to another value all crank lengths for end will be set to 0.
When setting this value to 0 HookLength1 will be set to 0.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: hookAngle1 must be at least 0 and no more than 180.
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.HookAngle0
The angle (in degrees) of the hook at the start. Must be at least 0 and no more than 180. If the value is 0 it means that there is no hook.
The default value is 0. When setting from 0 to another value, all crank lengths for start will be set to 0.
When setting this value to 0 HookLength0 will be set to 0.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: hookAngle0 must be at least 0 and no more than 180.
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.BarModelDiameter
Defines the model diameter of the bar.
The default value is 0.0.
When this is changed, the CrankStraightLength0, CrankStraightLength1, CrankAnledLength0, CrankAnledLength1 will be recomputed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for barModelDiameter is not finite
Since:
2022

Autodesk.Revit.DB.Structure.RebarBendData.TerminationRotationAngle1
Identifies he termination's rotation angle (in radians) at the end.
The default value is 0.0
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for terminationRotationAngle1 is not finite
Since:
2026

Autodesk.Revit.DB.Structure.RebarBendData.TerminationRotationAngle0
Identifies the termination's rotation angle (in radians) at the start.
The default value is 0.0
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for terminationRotationAngle0 is not finite
Since:
2026

Autodesk.Revit.DB.Structure.RebarBendData.HookBendRadius
The radius of the hook fillets in the Rebar shape.
The default value is 0.0.
Remarks:
Inner radius, not centerline
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for hookBendRadius is not finite
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.TerminationOrientation1
Identifies the orientation of the termination (e.g. hook, crank) at the end.
The default value is RebarTerminationOrientation::Left.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Structure.RebarBendData.TerminationOrientation0
Identifies he orientation of the termination (e.g. hook, crank) at the start.
The default value is RebarTerminationOrientation::Left.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Structure.RebarBendData.HookLength1
The extension length of the hook at the end.
The default value is 0.0.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for hookLength1 is not finite
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.HookLength0
The extension length of the hook at the start.
The default value is 0.0.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for hookLength0 is not finite
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.BarNominalDiameter
Defines the nominal diameter of the bar.
The default value is 0.0.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for barNominalDiameter is not finite
Since:
2022

Autodesk.Revit.DB.Structure.RebarBendData.BendRadius
The radius of all fillets, except hook fillets, in the Rebar shape.
The default value is 0.0.
Remarks:
Inner radius, not centerline
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for bendRadius is not finite
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.#ctor(Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.BarTerminationsData)
Constructs a new RebarBendData using the bar type, style and termination's values.
barType:
The RebarBarType.
style:
The style.
barTerminationsData:
The bar terminaions data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Structure.RebarBendData
The values in this class provide a summary of information taken from the RebarBarType, RebarHookType, and RebarStyle.
Since:
2012